/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
Напишите программу, которая вводит три int числа, сортирует их по возрастанию и выводит на экран. 
Используйте не больше трёх простых if. 
Массивы и прочие коллекции, а также else,
&&, || и другие усложняющие конструкции не применять.
 */
//
//package lab1_2.P1;
//
//import java.util.Scanner;
//
//public class P1 {
//
//      public static void main(String[] args) {
//      Scanner in = new Scanner (System.in);
//          
//        System.out.println ("Ввод 1:");
//        int x = in.nextInt();
//          
//        System.out.println ("Ввод 2:");
//        int y = in.nextInt();
//       
//        System.out.println ("Ввод 3:");
//        int z = in.nextInt();
//          
//        int max;
//        
//        if (x > y) {max = x; x = y; y = max;}
//        if (x > z) {max = x; x = z; z = max;}   
//        if (y > z) {max = y; y = z; z = max;}    
//        
//        System.out.println("Сортировка: " + x + ", " + y + ", " + z);
//      }
//          
//    }
    

